---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.SomeElementsPreventAssemblyTypeChange
source: html/c497ae78-e70d-fa94-4c5e-d17d40650421.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.SomeElementsPreventAssemblyTypeChange Property

Assembly cannot be changed to selected type. Some elements in the target assembly prevent the type change from occurring.
 These tend to be parts and nested elements such as mullion, curtain panels, and members of trusses.

## Syntax (C#)
```csharp
public static FailureDefinitionId SomeElementsPreventAssemblyTypeChange { get; }
```